Revit 2027 API
BoundaryConditions.IsValidReference Method
 Checks if the provided reference can host a boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidReference(
	Document doc,
	Reference reference,
	BoundaryConditionsType type,
	bool isConstrainedOnHost
)
Public Shared Function IsValidReference (
	doc As Document,
	reference As Reference,
	type As BoundaryConditionsType,
	isConstrainedOnHost As Boolean
) As Boolean
public:
static bool IsValidReference(
	Document^ doc,
	Reference^ reference,
	BoundaryConditionsType type,
	bool isConstrainedOnHost
)
static member IsValidReference :
        doc : Document *
        reference : Reference *
        type : BoundaryConditionsType *
        isConstrainedOnHost : bool -> bool
Parameters
doc Document
 The document containing both the host and the boundary conditions.
reference Reference
 A reference to an analytical element.
type BoundaryConditionsType
 The type of the boundary conditions that is about to be hosted.
isConstrainedOnHost Boolean
 A value indicating if the boundary conditions is constrained on host or not.
Return Value
Boolean
 True if a boundary conditions can be placed on the input host.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace